package main.java.com.pro100v1ad3000.ui.utils;

public class ScrollBar { //

    /*
    В качестве входных аргументов передается:

    (x1, y1, width1, width2) – Размеры окна с ползунком.
    (x2, y2, width2, height2) - Реальные размеры окна, если бы не нужен был ползунок.

    В качестве результата:

    1)	Рисует ползунок в области окна с ползунком.
    2)	Мог через колесико мыши или перетаскивая вручную “скролить окно”. При этом возвращая с какой координаты реального размера окна начать рисовать окно с ползунком.

     */

    public ScrollBar() {

    }

}
